MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GM310/mcu.h
#define CNENF CNENF
extern volatile uint16_t CNENF __attribute__((__sfr__));
typedef struct tagCNENFBITS {
  uint16_t CNIEF0:1;
  uint16_t CNIEF1:1;
  uint16_t :2;
  uint16_t CNIEF4:1;
  uint16_t CNIEF5:1;
  uint16_t CNIEF6:1;
  uint16_t CNIEF7:1;
  uint16_t :1;
  uint16_t CNIEF9:1;
  uint16_t CNIEF10:1;
  uint16_t :1;
  uint16_t CNIEF12:1;
  uint16_t CNIEF13:1;
} CNENFBITS;
extern volatile CNENFBITS CNENFbits __attribute__((__sfr__));

#define CNPUF CNPUF
extern volatile uint16_t CNPUF __attribute__((__sfr__));
typedef struct tagCNPUFBITS {
  uint16_t CNPUF0:1;
  uint16_t CNPUF1:1;
  uint16_t :2;
  uint16_t CNPUF4:1;
  uint16_t CNPUF5:1;
  uint16_t CNPUF6:1;
  uint16_t CNPUF7:1;
  uint16_t :1;
  uint16_t CNPUF9:1;
  uint16_t CNPUF10:1;
  uint16_t :1;
  uint16_t CNPUF12:1;
  uint16_t CNPUF13:1;
} CNPUFBITS;
extern volatile CNPUFBITS CNPUFbits __attribute__((__sfr__));

#define CNPDF CNPDF
extern volatile uint16_t CNPDF __attribute__((__sfr__));
typedef struct tagCNPDFBITS {
  uint16_t CNPDF0:1;
  uint16_t CNPDF1:1;
  uint16_t :2;
  uint16_t CNPDF4:1;
  uint16_t CNPDF5:1;
  uint16_t CNPDF6:1;
  uint16_t CNPDF7:1;
  uint16_t :1;
  uint16_t CNPDF9:1;
  uint16_t CNPDF10:1;
  uint16_t :1;
  uint16_t CNPDF12:1;
  uint16_t CNPDF13:1;
} CNPDFBITS;
extern volatile CNPDFBITS CNPDFbits __attribute__((__sfr__));

#define ANSELF ANSELF
extern volatile uint16_t ANSELF __attribute__((__sfr__));
typedef struct tagANSELFBITS {
  uint16_t :4;
  uint16_t ANSF4:1;
  uint16_t ANSF5:1;
  uint16_t :3;
  uint16_t ANSF9:1;
  uint16_t ANSF10:1;
  uint16_t :1;
  uint16_t ANSF12:1;
  uint16_t ANSF13:1;
} ANSELFBITS;
extern volatile ANSELFBITS ANSELFbits __attribute__((__sfr__));

#define TRISG TRISG
extern volatile uint16_t TRISG __attribute__((__sfr__));
typedef struct tagTRISGBITS {
  uint16_t TRISG0:1;
  uint16_t TRISG1:1;
  uint16_t TRISG2:1;
  uint16_t TRISG3:1;
  uint16_t :2;
  uint16_t TRISG6:1;
  uint16_t TRISG7:1;
  uint16_t TRISG8:1;
  uint16_t TRISG9:1;
  uint16_t TRISG10:1;
  uint16_t TRISG11:1;
  uint16_t TRISG12:1;
  uint16_t TRISG13:1;
  uint16_t TRISG14:1;
  uint16_t TRISG15:1;
} TRISGBITS;
extern volatile TRISGBITS TRISGbits __attribute__((__sfr__));

#define PORTG PORTG
extern volatile uint16_t PORTG __attribute__((__sfr__));
typedef struct tagPORTGBITS {
  uint16_t RG0:1;
  uint16_t RG1:1;
  uint16_t RG2:1;
  uint16_t RG3:1;
  uint16_t :2;
  uint16_t RG6:1;
  uint16_t RG7:1;
  uint16_t RG8:1;
  uint16_t RG9:1;
  uint16_t RG10:1;
  uint16_t RG11:1;
  uint16_t RG12:1;
  uint16_t RG13:1;
  uint16_t RG14:1;
  uint16_t RG15:1;
} PORTGBITS;
extern volatile PORTGBITS PORTGbits __attribute__((__sfr__));

#define LATG LATG
extern volatile uint16_t LATG __attribute__((__sfr__));
typedef struct tagLATGBITS {
  uint16_t LATG0:1;
  uint16_t LATG1:1;
  uint16_t LATG2:1;
  uint16_t LATG3:1;
  uint16_t :2;
  uint16_t LATG6:1;
  uint16_t LATG7:1;
  uint16_t LATG8:1;
  uint16_t LATG9:1;
  uint16_t LATG10:1;
  uint16_t LATG11:1;
  uint16_t LATG12:1;
  uint16_t LATG13:1;
  uint16_t LATG14:1;
  uint16_t LATG15:1;
} LATGBITS;
extern volatile LATGBITS LATGbits __attribute__((__sfr__));

#define ODCG ODCG
extern volatile uint16_t ODCG __attribute__((__sfr__));
typedef struct tagODCGBITS {
  uint16_t ODCG0:1;
  uint16_t ODCG1:1;
  uint16_t ODCG2:1;
  uint16_t ODCG3:1;
  uint16_t :2;
  uint16_t ODCG6:1;
  uint16_t ODCG7:1;
  uint16_t ODCG8:1;
  uint16_t ODCG9:1;
  uint16_t ODCG10:1;
  uint16_t ODCG11:1;
  uint16_t ODCG12:1;
  uint16_t ODCG13:1;
  uint16_t ODCG14:1;
  uint16_t ODCG15:1;
} ODCGBITS;
extern volatile ODCGBITS ODCGbits __attribute__((__sfr__));

#define CNENG CNENG
extern volatile uint16_t CNENG __attribute__((__sfr__));
typedef struct tagCNENGBITS {
  uint16_t CNIEG0:1;
  uint16_t CNIEG1:1;
  uint16_t CNIEG2:1;
  uint16_t CNIEG3:1;
  uint16_t :2;
  uint16_t CNIEG6:1;
  uint16_t CNIEG7:1;
  uint16_t CNIEG8:1;
  uint16_t CNIEG9:1;
  uint16_t CNIEG10:1;
  uint16_t CNIEG11:1;
  uint16_t CNIEG12:1;
  uint16_t CNIEG13:1;
  uint16_t CNIEG14:1;
  uint16_t CNIEG15:1;
} CNENGBITS;
extern volatile CNENGBITS CNENGbits __attribute__((__sfr__));

#define CNPUG CNPUG
extern volatile uint16_t CNPUG __attribute__((__sfr__));
typedef struct tagCNPUGBITS {
  uint16_t CNPUG0:1;
  uint16_t CNPUG1:1;
  uint16_t CNPUG2:1;
  uint16_t CNPUG3:1;
  uint16_t :2;
  uint16_t CNPUG6:1;
  uint16_t CNPUG7:1;
  uint16_t CNPUG8:1;
  uint16_t CNPUG9:1;
  uint16_t CNPUG10:1;
  uint16_t CNPUG11:1;
  uint16_t CNPUG12:1;
  uint16_t CNPUG13:1;
  uint16_t CNPUG14:1;
  uint16_t CNPUG15:1;
} CNPUGBITS;
extern volatile CNPUGBITS CNPUGbits __attribute__((__sfr__));

#define CNPDG CNPDG
extern volatile uint16_t CNPDG __attribute__((__sfr__));
typedef struct tagCNPDGBITS {
  uint16_t CNPDG0:1;
  uint16_t CNPDG1:1;
  uint16_t CNPDG2:1;
  uint16_t CNPDG3:1;
  uint16_t :2;
  uint16_t CNPDG6:1;
  uint16_t CNPDG7:1;
  uint16_t CNPDG8:1;
  uint16_t CNPDG9:1;
  uint16_t CNPDG10:1;
  uint16_t CNPDG11:1;
  uint16_t CNPDG12:1;
  uint16_t CNPDG13:1;
  uint16_t CNPDG14:1;
  uint16_t CNPDG15:1;
} CNPDGBITS;
extern volatile CNPDGBITS CNPDGbits __attribute__((__sfr__));

#define ANSELG ANSELG
extern volatile uint16_t ANSELG __attribute__((__sfr__));
typedef struct tagANSELGBITS {
  uint16_t :2;
  uint16_t ANSG2:1;
  uint16_t ANSG3:1;
  uint16_t :2;
  uint16_t ANSG6:1;
  uint16_t ANSG7:1;
  uint16_t ANSG8:1;
  uint16_t ANSG9:1;
  uint16_t ANSG10:1;
  uint16_t ANSG11:1;
  uint16_t :3;
  uint16_t ANSG15:1;
} ANSELGBITS;
extern volatile ANSELGBITS ANSELGbits __attribute__((__sfr__));

#define PADCFG1 PADCFG1
extern volatile uint16_t PADCFG1 __attribute__((__sfr__));
typedef struct tagPADCFG1BITS {
  uint16_t PMPTTL:1;
  uint16_t RTSECSEL:1;
} PADCFG1BITS;
extern volatile PADCFG1BITS PADCFG1bits __attribute__((__sfr__));

#define _APPO _APPO
extern volatile uint16_t _APPO __attribute__((__sfr__));
#define _APPIN _APPIN
extern volatile uint16_t _APPIN __attribute__((__sfr__));
#define APPS APPS
extern volatile uint16_t APPS __attribute__((__sfr__));
typedef struct tagAPPSBITS {
  uint16_t APIFUL:1;
  uint16_t APIOV:1;
  uint16_t AROFUL:1;
  uint16_t APOOV:1;
  uint16_t STRFUL:1;
} APPSBITS;
