MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GM310/mcu.h
#define _SPI3STAT_SPIROV_POSITION                0x00000006
#define _SPI3STAT_SPIROV_MASK                    0x00000040
#define _SPI3STAT_SPIROV_LENGTH                  0x00000001

#define _SPI3STAT_SRMPT_POSITION                 0x00000007
#define _SPI3STAT_SRMPT_MASK                     0x00000080
#define _SPI3STAT_SRMPT_LENGTH                   0x00000001

#define _SPI3STAT_SPIBEC_POSITION                0x00000008
#define _SPI3STAT_SPIBEC_MASK                    0x00000700
#define _SPI3STAT_SPIBEC_LENGTH                  0x00000003

#define _SPI3STAT_SPISIDL_POSITION               0x0000000D
#define _SPI3STAT_SPISIDL_MASK                   0x00002000
#define _SPI3STAT_SPISIDL_LENGTH                 0x00000001

#define _SPI3STAT_SPIEN_POSITION                 0x0000000F
#define _SPI3STAT_SPIEN_MASK                     0x00008000
#define _SPI3STAT_SPIEN_LENGTH                   0x00000001

#define _SPI3STAT_SISEL0_POSITION                0x00000002
#define _SPI3STAT_SISEL0_MASK                    0x00000004
#define _SPI3STAT_SISEL0_LENGTH                  0x00000001

#define _SPI3STAT_SISEL1_POSITION                0x00000003
#define _SPI3STAT_SISEL1_MASK                    0x00000008
#define _SPI3STAT_SISEL1_LENGTH                  0x00000001

#define _SPI3STAT_SISEL2_POSITION                0x00000004
#define _SPI3STAT_SISEL2_MASK                    0x00000010
#define _SPI3STAT_SISEL2_LENGTH                  0x00000001

#define _SPI3STAT_SPIBEC0_POSITION               0x00000008
#define _SPI3STAT_SPIBEC0_MASK                   0x00000100
#define _SPI3STAT_SPIBEC0_LENGTH                 0x00000001

#define _SPI3STAT_SPIBEC1_POSITION               0x00000009
#define _SPI3STAT_SPIBEC1_MASK                   0x00000200
#define _SPI3STAT_SPIBEC1_LENGTH                 0x00000001

#define _SPI3STAT_SPIBEC2_POSITION               0x0000000A
#define _SPI3STAT_SPIBEC2_MASK                   0x00000400
#define _SPI3STAT_SPIBEC2_LENGTH                 0x00000001

#define _SPI3CON1_PPRE_POSITION                  0x00000000
#define _SPI3CON1_PPRE_MASK                      0x00000003
#define _SPI3CON1_PPRE_LENGTH                    0x00000002

#define _SPI3CON1_SPRE_POSITION                  0x00000002
#define _SPI3CON1_SPRE_MASK                      0x0000001C
#define _SPI3CON1_SPRE_LENGTH                    0x00000003

#define _SPI3CON1_MSTEN_POSITION                 0x00000005
#define _SPI3CON1_MSTEN_MASK                     0x00000020
#define _SPI3CON1_MSTEN_LENGTH                   0x00000001

#define _SPI3CON1_CKP_POSITION                   0x00000006
#define _SPI3CON1_CKP_MASK                       0x00000040
#define _SPI3CON1_CKP_LENGTH                     0x00000001

#define _SPI3CON1_SSEN_POSITION                  0x00000007
#define _SPI3CON1_SSEN_MASK                      0x00000080
#define _SPI3CON1_SSEN_LENGTH                    0x00000001

#define _SPI3CON1_CKE_POSITION                   0x00000008
#define _SPI3CON1_CKE_MASK                       0x00000100
#define _SPI3CON1_CKE_LENGTH                     0x00000001

#define _SPI3CON1_SMP_POSITION                   0x00000009
#define _SPI3CON1_SMP_MASK                       0x00000200
#define _SPI3CON1_SMP_LENGTH                     0x00000001

#define _SPI3CON1_MODE16_POSITION                0x0000000A
#define _SPI3CON1_MODE16_MASK                    0x00000400
#define _SPI3CON1_MODE16_LENGTH                  0x00000001

#define _SPI3CON1_DISSDO_POSITION                0x0000000B
#define _SPI3CON1_DISSDO_MASK                    0x00000800
#define _SPI3CON1_DISSDO_LENGTH                  0x00000001

#define _SPI3CON1_DISSCK_POSITION                0x0000000C
#define _SPI3CON1_DISSCK_MASK                    0x00001000
#define _SPI3CON1_DISSCK_LENGTH                  0x00000001

#define _SPI3CON1_PPRE0_POSITION                 0x00000000
#define _SPI3CON1_PPRE0_MASK                     0x00000001
#define _SPI3CON1_PPRE0_LENGTH                   0x00000001

#define _SPI3CON1_PPRE1_POSITION                 0x00000001
#define _SPI3CON1_PPRE1_MASK                     0x00000002
#define _SPI3CON1_PPRE1_LENGTH                   0x00000001

#define _SPI3CON1_SPRE0_POSITION                 0x00000002
#define _SPI3CON1_SPRE0_MASK                     0x00000004
#define _SPI3CON1_SPRE0_LENGTH                   0x00000001

#define _SPI3CON1_SPRE1_POSITION                 0x00000003
#define _SPI3CON1_SPRE1_MASK                     0x00000008
#define _SPI3CON1_SPRE1_LENGTH                   0x00000001

#define _SPI3CON1_SPRE2_POSITION                 0x00000004
#define _SPI3CON1_SPRE2_MASK                     0x00000010
#define _SPI3CON1_SPRE2_LENGTH                   0x00000001

#define _SPI3CON2_SPIBEN_POSITION                0x00000000
#define _SPI3CON2_SPIBEN_MASK                    0x00000001
#define _SPI3CON2_SPIBEN_LENGTH                  0x00000001

#define _SPI3CON2_FRMDLY_POSITION                0x00000001
#define _SPI3CON2_FRMDLY_MASK                    0x00000002
#define _SPI3CON2_FRMDLY_LENGTH                  0x00000001

#define _SPI3CON2_FRMPOL_POSITION                0x0000000D
#define _SPI3CON2_FRMPOL_MASK                    0x00002000
#define _SPI3CON2_FRMPOL_LENGTH                  0x00000001

#define _SPI3CON2_SPIFSD_POSITION                0x0000000E
#define _SPI3CON2_SPIFSD_MASK                    0x00004000
#define _SPI3CON2_SPIFSD_LENGTH                  0x00000001

#define _SPI3CON2_FRMEN_POSITION                 0x0000000F
#define _SPI3CON2_FRMEN_MASK                     0x00008000
#define _SPI3CON2_FRMEN_LENGTH                   0x00000001

#define _U4MODE_STSEL_POSITION                   0x00000000
#define _U4MODE_STSEL_MASK                       0x00000001
#define _U4MODE_STSEL_LENGTH                     0x00000001

#define _U4MODE_PDSEL_POSITION                   0x00000001
#define _U4MODE_PDSEL_MASK                       0x00000006
#define _U4MODE_PDSEL_LENGTH                     0x00000002

#define _U4MODE_BRGH_POSITION                    0x00000003
#define _U4MODE_BRGH_MASK                        0x00000008
#define _U4MODE_BRGH_LENGTH                      0x00000001

#define _U4MODE_URXINV_POSITION                  0x00000004
#define _U4MODE_URXINV_MASK                      0x00000010
#define _U4MODE_URXINV_LENGTH                    0x00000001

#define _U4MODE_ABAUD_POSITION                   0x00000005
#define _U4MODE_ABAUD_MASK                       0x00000020
#define _U4MODE_ABAUD_LENGTH                     0x00000001

#define _U4MODE_LPBACK_POSITION                  0x00000006
#define _U4MODE_LPBACK_MASK                      0x00000040
#define _U4MODE_LPBACK_LENGTH                    0x00000001

#define _U4MODE_WAKE_POSITION                    0x00000007
#define _U4MODE_WAKE_MASK                        0x00000080
#define _U4MODE_WAKE_LENGTH                      0x00000001

#define _U4MODE_UEN_POSITION                     0x00000008
#define _U4MODE_UEN_MASK                         0x00000300
#define _U4MODE_UEN_LENGTH                       0x00000002

