MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EP128GM310/mcu.h
#define _RPINR8_IC4R2_POSITION                   0x0000000A
#define _RPINR8_IC4R2_MASK                       0x00000400
#define _RPINR8_IC4R2_LENGTH                     0x00000001

#define _RPINR8_IC4R3_POSITION                   0x0000000B
#define _RPINR8_IC4R3_MASK                       0x00000800
#define _RPINR8_IC4R3_LENGTH                     0x00000001

#define _RPINR8_IC4R4_POSITION                   0x0000000C
#define _RPINR8_IC4R4_MASK                       0x00001000
#define _RPINR8_IC4R4_LENGTH                     0x00000001

#define _RPINR8_IC4R5_POSITION                   0x0000000D
#define _RPINR8_IC4R5_MASK                       0x00002000
#define _RPINR8_IC4R5_LENGTH                     0x00000001

#define _RPINR8_IC4R6_POSITION                   0x0000000E
#define _RPINR8_IC4R6_MASK                       0x00004000
#define _RPINR8_IC4R6_LENGTH                     0x00000001

#define _RPINR9_IC5R_POSITION                    0x00000000
#define _RPINR9_IC5R_MASK                        0x0000007F
#define _RPINR9_IC5R_LENGTH                      0x00000007

#define _RPINR9_IC6R_POSITION                    0x00000008
#define _RPINR9_IC6R_MASK                        0x00007F00
#define _RPINR9_IC6R_LENGTH                      0x00000007

#define _RPINR9_IC5R0_POSITION                   0x00000000
#define _RPINR9_IC5R0_MASK                       0x00000001
#define _RPINR9_IC5R0_LENGTH                     0x00000001

#define _RPINR9_IC5R1_POSITION                   0x00000001
#define _RPINR9_IC5R1_MASK                       0x00000002
#define _RPINR9_IC5R1_LENGTH                     0x00000001

#define _RPINR9_IC5R2_POSITION                   0x00000002
#define _RPINR9_IC5R2_MASK                       0x00000004
#define _RPINR9_IC5R2_LENGTH                     0x00000001

#define _RPINR9_IC5R3_POSITION                   0x00000003
#define _RPINR9_IC5R3_MASK                       0x00000008
#define _RPINR9_IC5R3_LENGTH                     0x00000001

#define _RPINR9_IC5R4_POSITION                   0x00000004
#define _RPINR9_IC5R4_MASK                       0x00000010
#define _RPINR9_IC5R4_LENGTH                     0x00000001

#define _RPINR9_IC5R5_POSITION                   0x00000005
#define _RPINR9_IC5R5_MASK                       0x00000020
#define _RPINR9_IC5R5_LENGTH                     0x00000001

#define _RPINR9_IC5R6_POSITION                   0x00000006
#define _RPINR9_IC5R6_MASK                       0x00000040
#define _RPINR9_IC5R6_LENGTH                     0x00000001

#define _RPINR9_IC6R0_POSITION                   0x00000008
#define _RPINR9_IC6R0_MASK                       0x00000100
#define _RPINR9_IC6R0_LENGTH                     0x00000001

#define _RPINR9_IC6R1_POSITION                   0x00000009
#define _RPINR9_IC6R1_MASK                       0x00000200
#define _RPINR9_IC6R1_LENGTH                     0x00000001

#define _RPINR9_IC6R2_POSITION                   0x0000000A
#define _RPINR9_IC6R2_MASK                       0x00000400
#define _RPINR9_IC6R2_LENGTH                     0x00000001

#define _RPINR9_IC6R3_POSITION                   0x0000000B
#define _RPINR9_IC6R3_MASK                       0x00000800
#define _RPINR9_IC6R3_LENGTH                     0x00000001

#define _RPINR9_IC6R4_POSITION                   0x0000000C
#define _RPINR9_IC6R4_MASK                       0x00001000
#define _RPINR9_IC6R4_LENGTH                     0x00000001

#define _RPINR9_IC6R5_POSITION                   0x0000000D
#define _RPINR9_IC6R5_MASK                       0x00002000
#define _RPINR9_IC6R5_LENGTH                     0x00000001

#define _RPINR9_IC6R6_POSITION                   0x0000000E
#define _RPINR9_IC6R6_MASK                       0x00004000
#define _RPINR9_IC6R6_LENGTH                     0x00000001

#define _RPINR10_IC7R_POSITION                   0x00000000
#define _RPINR10_IC7R_MASK                       0x0000007F
#define _RPINR10_IC7R_LENGTH                     0x00000007

#define _RPINR10_IC8R_POSITION                   0x00000008
#define _RPINR10_IC8R_MASK                       0x00007F00
#define _RPINR10_IC8R_LENGTH                     0x00000007

#define _RPINR10_IC7R0_POSITION                  0x00000000
#define _RPINR10_IC7R0_MASK                      0x00000001
#define _RPINR10_IC7R0_LENGTH                    0x00000001

#define _RPINR10_IC7R1_POSITION                  0x00000001
#define _RPINR10_IC7R1_MASK                      0x00000002
#define _RPINR10_IC7R1_LENGTH                    0x00000001

#define _RPINR10_IC7R2_POSITION                  0x00000002
#define _RPINR10_IC7R2_MASK                      0x00000004
#define _RPINR10_IC7R2_LENGTH                    0x00000001

#define _RPINR10_IC7R3_POSITION                  0x00000003
#define _RPINR10_IC7R3_MASK                      0x00000008
#define _RPINR10_IC7R3_LENGTH                    0x00000001

#define _RPINR10_IC7R4_POSITION                  0x00000004
#define _RPINR10_IC7R4_MASK                      0x00000010
#define _RPINR10_IC7R4_LENGTH                    0x00000001

#define _RPINR10_IC7R5_POSITION                  0x00000005
#define _RPINR10_IC7R5_MASK                      0x00000020
#define _RPINR10_IC7R5_LENGTH                    0x00000001

#define _RPINR10_IC7R6_POSITION                  0x00000006
#define _RPINR10_IC7R6_MASK                      0x00000040
#define _RPINR10_IC7R6_LENGTH                    0x00000001

#define _RPINR10_IC8R0_POSITION                  0x00000008
#define _RPINR10_IC8R0_MASK                      0x00000100
#define _RPINR10_IC8R0_LENGTH                    0x00000001

#define _RPINR10_IC8R1_POSITION                  0x00000009
#define _RPINR10_IC8R1_MASK                      0x00000200
#define _RPINR10_IC8R1_LENGTH                    0x00000001

#define _RPINR10_IC8R2_POSITION                  0x0000000A
#define _RPINR10_IC8R2_MASK                      0x00000400
#define _RPINR10_IC8R2_LENGTH                    0x00000001

#define _RPINR10_IC8R3_POSITION                  0x0000000B
#define _RPINR10_IC8R3_MASK                      0x00000800
#define _RPINR10_IC8R3_LENGTH                    0x00000001

#define _RPINR10_IC8R4_POSITION                  0x0000000C
#define _RPINR10_IC8R4_MASK                      0x00001000
#define _RPINR10_IC8R4_LENGTH                    0x00000001

